{
    "contact": {
        "title": "Contact",
        "content": "<h2>Contact</h2><form class=\"form\" method=\"post\" action=\"/contact.php?send=1\"><p class=\"name\"><label for=\"name\" style=\"display:none;\">Name:</label><input type=\"text\" name=\"name\" id=\"name\" placeholder=\"Your Name\" /></p><p class=\"email\"><label for=\"email\" style=\"display:none;\">Email:</label><input type=\"text\" name=\"email\" id=\"email\" placeholder=\"Your Email\" /></p><p class=\"text\"><label style=\"display:none;\">Message:</label><textarea name=\"message\" placeholder=\"Your Message\"></textarea></p><p class=\"submit\"><input type=\"submit\" value=\"Send\" /></p></form>"
    },
    "about": {
        "title": "About",
        "content": "<article class=\"single\"><div class=\"col-lg-5 col-md-5 col-sm-6 col-sm-12\"><div id=\"avatar\" class=\"image\" style=\"background-image:url(/assets/img/avatar.jpg);\"></div></div><div class=\"col-lg-7 col-md-7 col-sm-6 col-sm-12\"><h2>About</h2><p>Hello and welcome to my Website! I currently study Computer Science in the University of Brasilia in Brazil. I love programming and I spend most of my time doing it. I have already made tons of small aplications for myself, but only recently I built up enough knowledge to develop commercial level Apps.</p><p>I really like the Objective-C language, and it is the language I currently know the most. I also know a lot of Java and much of C and PHP. I can write something in C#, VB.NET and Ruby. I have already used some other languages, but they already fell in the realms of oblivion inside my brain.</p><hr><h2>Experiments</h2><p>In my spare time I like to work on coding experiments. Some become fully-fledged apps, others die right away. Some others are just too simple to become a product. Some of the latter will be posted in the list below.</p><ul id=\"experiments\"><li><a href=\"/experiments/voyagers\">Voyagers Now</a> – September 2013<br><p>In September 2013, NASA announced that the Voyager 1 probe, launched in 1977, has passed the <a href=\"http://en.wikipedia.org/wiki/Heliopause_(astronomy)\" target=\"_blank\">heliopause</a>. This event caused some commotion on the internet and I, being a space geek, decided to create a simple hot site displaying how far both voyagers are from us. I used, with the propper permission, a JS script found in the NASA JPL website. The result is a simple diagram displaying the relative distance of the Voyager probes &mdash; and the planets &mdash; from the Earth and the Sun.</p></li></ul><hr><p>If you wish to send me a message, please contact me clicking the button below.</p><p>Thank you for your visit and have a nice day!</p><p class=\"link\"><a href=\"/contact\">Contact Me</a></p><div class=\"clearfix\"></div></div></article>"
    }
}